Medevantage Performane testing/20User1Secramp10loop/20User1Secramp10loop.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
      <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
      <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
        <boolProp name="LoopController.continue_forever">false</boolProp>
        <stringProp name="LoopController.loops">10</stringProp>
      </elementProp>
      <stringProp name="ThreadGroup.num_threads">20</stringProp>
      <stringProp name="ThreadGroup.ramp_time">1</stringProp>
      <longProp name="ThreadGroup.start_time">1370726934000</longProp>
      <longProp name="ThreadGroup.end_time">1370726934000</longProp>
      <boolProp name="ThreadGroup.scheduler">false</boolProp>
      <stringProp name="ThreadGroup.duration">900</stringProp>
      <stringProp name="ThreadGroup.delay">300</stringProp>
      <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
    </ThreadGroup>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">Application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="filename">C:/MDPerformanceTesting/05.06.2020/05.06.2020/TestData.csv</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
      </CSVDataSet>
      <hashTree/>
      <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="20User1SecRampUp10loop" enabled="true">
        <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
          <collectionProp name="Arguments.arguments">
            <elementProp name="" elementType="HTTPArgument">
              <boolProp name="HTTPArgument.always_encode">false</boolProp>
              <stringProp name="Argument.value">{&#xd;
    &quot;suiteCrmPatientId&quot;: &quot;CDCFA904-89C9-45FC-AC9B-8625C52BD43E&quot;,&#xd;
    &quot;id&quot;: 0,&#xd;
    &quot;medevantageId&quot;: &quot;&quot;,&#xd;
    &quot;externalSystemId&quot;: &quot;&quot;,&#xd;
    &quot;practitionerId&quot;: &quot;120&quot;,&#xd;
    &quot;npi&quot;: &quot;1134510258&quot;,&#xd;
    &quot;location&quot;: &quot;${locationId}&quot;,&#xd;
    &quot;insurance&quot;: null,&#xd;
    &quot;applicationUserId&quot;: null,&#xd;
    &quot;resourceId&quot;: &quot;${resourceID}&quot;,&#xd;
    &quot;rescheduleAppointmentId&quot;: &quot;0&quot;,&#xd;
    &quot;encounterId&quot;: &quot;0&quot;,&#xd;
    &quot;identifier&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: 0,&#xd;
            &quot;uses&quot;: &quot;&quot;,&#xd;
            &quot;dataType&quot;: &quot;&quot;,&#xd;
            &quot;value&quot;: &quot;&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;participant&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: &quot;${Participant_ProviderID}&quot;,&#xd;
            &quot;type&quot;: &quot;PROVIDER&quot;,&#xd;
            &quot;name&quot;: {&#xd;
                &quot;fname&quot;: &quot;${Provider_FirstName}&quot;,&#xd;
                &quot;mname&quot;: &quot;&quot;,&#xd;
                &quot;lname&quot;: &quot;${Provider_LastName}&quot;,&#xd;
                &quot;id&quot;: &quot;&quot;,&#xd;
                &quot;uses&quot;: &quot;&quot;,&#xd;
                &quot;text&quot;: {&#xd;
                    &quot;id&quot;: &quot;&quot;,&#xd;
                    &quot;text&quot;: &quot;&quot;,&#xd;
                    &quot;isHtml&quot;: &quot;&quot;&#xd;
                },&#xd;
                &quot;prefix&quot;: &quot;&quot;,&#xd;
                &quot;suffix&quot;: &quot;&quot;&#xd;
            },&#xd;
            &quot;race&quot;: {&#xd;
                &quot;id&quot;: 0,&#xd;
                &quot;code&quot;: &quot;&quot;,&#xd;
                &quot;display&quot;: &quot;&quot;,&#xd;
                &quot;type&quot;: &quot;&quot;&#xd;
            },&#xd;
            &quot;orgName&quot;: &quot;&quot;,&#xd;
            &quot;orgId&quot;: &quot;&quot;,&#xd;
            &quot;telecom&quot;: [&#xd;
                {&#xd;
                    &quot;id&quot;: &quot;&quot;,&#xd;
                    &quot;uses&quot;: &quot;&quot;,&#xd;
                    &quot;type&quot;: &quot;&quot;,&#xd;
                    &quot;ranks&quot;: &quot;&quot;,&#xd;
                    &quot;value&quot;: null&#xd;
                }&#xd;
            ],&#xd;
            &quot;gender&quot;: {&#xd;
                &quot;id&quot;: 0,&#xd;
                &quot;code&quot;: &quot;&quot;,&#xd;
                &quot;display&quot;: &quot;&quot;,&#xd;
                &quot;type&quot;: &quot;&quot;&#xd;
            },&#xd;
            &quot;dob&quot;: null,&#xd;
            &quot;required&quot;: false,&#xd;
            &quot;startDate&quot;: null,&#xd;
            &quot;endDate&quot;: null,&#xd;
            &quot;isActive&quot;: false,&#xd;
            &quot;photo&quot;: [&#xd;
                {&#xd;
                    &quot;id&quot;: &quot;&quot;,&#xd;
                    &quot;contentType&quot;: &quot;&quot;,&#xd;
                    &quot;language&quot;: &quot;&quot;,&#xd;
                    &quot;data&quot;: &quot;&quot;,&#xd;
                    &quot;url&quot;: &quot;&quot;,&#xd;
                    &quot;size&quot;: &quot;&quot;,&#xd;
                    &quot;hash&quot;: &quot;&quot;,&#xd;
                    &quot;title&quot;: &quot;&quot;,&#xd;
                    &quot;creation&quot;: &quot;&quot;,&#xd;
                    &quot;thumbnail&quot;: &quot;&quot;,&#xd;
                    &quot;name&quot;: &quot;&quot;,&#xd;
                    &quot;type&quot;: &quot;&quot;,&#xd;
                    &quot;isDefault&quot;: true,&#xd;
                    &quot;isProfileImage&quot;: true&#xd;
                }&#xd;
            ]&#xd;
        },&#xd;
        {&#xd;
            &quot;id&quot;: &quot;${Participant_PatientID}&quot;,&#xd;
            &quot;type&quot;: &quot;PATIENT&quot;,&#xd;
            &quot;name&quot;: {&#xd;
                &quot;id&quot;: &quot;${Patient_id}&quot;,&#xd;
                &quot;text&quot;: {&#xd;
                    &quot;id&quot;: 0,&#xd;
                    &quot;text&quot;: &quot;&quot;,&#xd;
                    &quot;isHtml&quot;: false&#xd;
                },&#xd;
                &quot;uses&quot;: &quot;&quot;,&#xd;
                &quot;fname&quot;: &quot;${Patient_FirstName}&quot;,&#xd;
                &quot;lname&quot;: &quot;${Patient_LastName}&quot;,&#xd;
                &quot;mname&quot;: &quot;&quot;,&#xd;
                &quot;prefix&quot;: &quot;&quot;,&#xd;
                &quot;suffix&quot;: &quot;&quot;&#xd;
            },&#xd;
            &quot;race&quot;: {&#xd;
                &quot;id&quot;: 1,&#xd;
                &quot;code&quot;: &quot;&quot;,&#xd;
                &quot;display&quot;: &quot;&quot;,&#xd;
                &quot;type&quot;: &quot;&quot;&#xd;
            },&#xd;
            &quot;orgName&quot;: &quot;&quot;,&#xd;
            &quot;orgId&quot;: &quot;&quot;,&#xd;
            &quot;telecom&quot;: [&#xd;
                {&#xd;
                    &quot;id&quot;: 0,&#xd;
                    &quot;type&quot;: &quot;EMAIL&quot;,&#xd;
                    &quot;uses&quot;: &quot;PERSONAL&quot;,&#xd;
                    &quot;ranks&quot;: &quot; &quot;,&#xd;
                    &quot;value&quot;: &quot;${Patient_Email}&quot;&#xd;
                },&#xd;
                {&#xd;
                    &quot;id&quot;: 1,&#xd;
                    &quot;type&quot;: &quot;CELL&quot;,&#xd;
                    &quot;uses&quot;: &quot;HOME&quot;,&#xd;
                    &quot;ranks&quot;: &quot; &quot;,&#xd;
                    &quot;value&quot;: &quot;${Patient_CellNo}&quot;&#xd;
                },&#xd;
                {&#xd;
                    &quot;id&quot;: 2,&#xd;
                    &quot;type&quot;: &quot;PHONE&quot;,&#xd;
                    &quot;uses&quot;: &quot;OFFICE&quot;,&#xd;
                    &quot;ranks&quot;: &quot; &quot;,&#xd;
                    &quot;value&quot;: &quot;&quot;&#xd;
                }&#xd;
            ],&#xd;
            &quot;gender&quot;: {&#xd;
                &quot;id&quot;: 0,&#xd;
                &quot;code&quot;: &quot;Male&quot;,&#xd;
                &quot;display&quot;: &quot;Male&quot;,&#xd;
                &quot;type&quot;: &quot;&quot;&#xd;
            },&#xd;
            &quot;dob&quot;: &quot;${Patient_DOB}&quot;,&#xd;
            &quot;required&quot;: false,&#xd;
            &quot;startDate&quot;: null,&#xd;
            &quot;endDate&quot;: null,&#xd;
            &quot;isActive&quot;: false,&#xd;
            &quot;photo&quot;: {&#xd;
                &quot;id&quot;: 0,&#xd;
                &quot;contentType&quot;: &quot;&quot;,&#xd;
                &quot;language&quot;: &quot;&quot;,&#xd;
                &quot;data&quot;: &quot;&quot;,&#xd;
                &quot;url&quot;: &quot;&quot;,&#xd;
                &quot;size&quot;: 0,&#xd;
                &quot;hash&quot;: &quot;&quot;,&#xd;
                &quot;title&quot;: &quot;&quot;,&#xd;
                &quot;creation&quot;: null,&#xd;
                &quot;thumbnail&quot;: &quot;&quot;,&#xd;
                &quot;name&quot;: &quot;&quot;,&#xd;
                &quot;type&quot;: &quot;&quot;,&#xd;
                &quot;isDefault&quot;: false,&#xd;
                &quot;isProfileImage&quot;: false&#xd;
            }&#xd;
        }&#xd;
    ],&#xd;
    &quot;providerLocation&quot;: {&#xd;
        &quot;id&quot;: &quot;${Provider_LocationId}&quot;,&#xd;
        &quot;uses&quot;: &quot;&quot;,&#xd;
        &quot;type&quot;: &quot;&quot;,&#xd;
        &quot;text&quot;: {&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;text&quot;: &quot;&quot;,&#xd;
            &quot;isHtml&quot;: &quot;&quot;&#xd;
        },&#xd;
        &quot;city&quot;: {&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;code&quot;: &quot;&quot;,&#xd;
            &quot;type&quot;: &quot;&quot;,&#xd;
            &quot;display&quot;: &quot;${Provider_City}&quot;&#xd;
        },&#xd;
        &quot;locationName&quot;: &quot;${Provider_Location}&quot;,&#xd;
        &quot;line1&quot;: [&#xd;
            &quot;61 Emerald Place&quot;&#xd;
        ],&#xd;
        &quot;state&quot;: {&#xd;
            &quot;code&quot;: &quot;NY&quot;,&#xd;
            &quot;display&quot;: &quot;NY&quot;,&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;type&quot;: &quot;&quot;&#xd;
        },&#xd;
        &quot;postalCode&quot;: {&#xd;
            &quot;display&quot;: &quot;127756049&quot;,&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;code&quot;: &quot;127756049&quot;,&#xd;
            &quot;type&quot;: &quot;&quot;&#xd;
        },&#xd;
        &quot;district&quot;: {&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;code&quot;: &quot;&quot;,&#xd;
            &quot;display&quot;: &quot;&quot;,&#xd;
            &quot;type&quot;: &quot;&quot;&#xd;
        },&#xd;
        &quot;period&quot;: {&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;startDate&quot;: &quot;&quot;,&#xd;
            &quot;endDate&quot;: &quot;&quot;&#xd;
        },&#xd;
        &quot;geoLocation&quot;: {&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;latitude&quot;: &quot;&quot;,&#xd;
            &quot;longitude&quot;: &quot;&quot;,&#xd;
            &quot;altitude&quot;: &quot;&quot;,&#xd;
            &quot;text&quot;: {&#xd;
                &quot;id&quot;: &quot;&quot;,&#xd;
                &quot;text&quot;: &quot;&quot;,&#xd;
                &quot;isHtml&quot;: &quot;&quot;&#xd;
            }&#xd;
        },&#xd;
        &quot;telecom&quot;: [&#xd;
            {&#xd;
                &quot;id&quot;: &quot;&quot;,&#xd;
                &quot;uses&quot;: &quot;&quot;,&#xd;
                &quot;type&quot;: &quot;&quot;,&#xd;
                &quot;ranks&quot;: &quot;&quot;,&#xd;
                &quot;value&quot;: &quot;8457946999&quot;&#xd;
            }&#xd;
        ],&#xd;
        &quot;distance&quot;: {&#xd;
            &quot;id&quot;: &quot;&quot;,&#xd;
            &quot;code&quot;: &quot;&quot;,&#xd;
            &quot;display&quot;: &quot;&quot;,&#xd;
            &quot;type&quot;: &quot;&quot;&#xd;
        },&#xd;
        &quot;isDefault&quot;: true&#xd;
    },&#xd;
    &quot;appointmentStatus&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;code&quot;: &quot;&quot;,&#xd;
        &quot;display&quot;: &quot;Pending&quot;,&#xd;
        &quot;type&quot;: &quot;&quot;&#xd;
    },&#xd;
    &quot;serviceCategory&quot;: {&#xd;
        &quot;id&quot;: &quot;&quot;,&#xd;
        &quot;code&quot;: &quot;&quot;,&#xd;
        &quot;display&quot;: &quot;&quot;,&#xd;
        &quot;type&quot;: &quot;&quot;&#xd;
    },&#xd;
    &quot;serviceType&quot;: {&#xd;
        &quot;id&quot;: &quot;68E83F05-5D0B-4C2F-962B-104986547F6F&quot;,&#xd;
        &quot;code&quot;: &quot;Follow Up Appointment&quot;,&#xd;
        &quot;display&quot;: &quot;Follow Up Appointment&quot;,&#xd;
        &quot;type&quot;: &quot;FUP&quot;&#xd;
    },&#xd;
    &quot;speciality&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;code&quot;: &quot;&quot;,&#xd;
        &quot;display&quot;: &quot;Internal Med&quot;,&#xd;
        &quot;type&quot;: &quot;&quot;&#xd;
    },&#xd;
    &quot;bookableFlag&quot;: false,&#xd;
    &quot;appointmentType&quot;: {&#xd;
        &quot;id&quot;: &quot;&quot;,&#xd;
        &quot;code&quot;: &quot;&quot;,&#xd;
        &quot;display&quot;: &quot;&quot;,&#xd;
        &quot;type&quot;: &quot;&quot;&#xd;
    },&#xd;
    &quot;reasonReference&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: 0,&#xd;
            &quot;code&quot;: &quot;&quot;,&#xd;
            &quot;display&quot;: &quot;&quot;,&#xd;
            &quot;type&quot;: &quot;&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;reasonCode&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;code&quot;: &quot;&quot;,&#xd;
        &quot;display&quot;: &quot;&quot;,&#xd;
        &quot;type&quot;: &quot;&quot;&#xd;
    },&#xd;
    &quot;priority&quot;: 0,&#xd;
    &quot;description&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;text&quot;: &quot;&quot;,&#xd;
        &quot;isHtml&quot;: false&#xd;
    },&#xd;
    &quot;supportingInformation&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: 0,&#xd;
            &quot;text&quot;: &quot;&quot;,&#xd;
            &quot;isHtml&quot;: false&#xd;
        }&#xd;
    ],&#xd;
    &quot;slot&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: 0,&#xd;
            &quot;startTime&quot;: &quot;${StartTime}&quot;,&#xd;
            &quot;startDate&quot;: &quot;${StartDate}&quot;,&#xd;
            &quot;note&quot;: {&#xd;
                &quot;id&quot;: 0,&#xd;
                &quot;text&quot;: &quot;string&quot;,&#xd;
                &quot;isHtml&quot;: true&#xd;
            },&#xd;
            &quot;color&quot;: {&#xd;
                &quot;id&quot;: 0,&#xd;
                &quot;code&quot;: &quot;string&quot;,&#xd;
                &quot;display&quot;: &quot;string&quot;,&#xd;
                &quot;type&quot;: &quot;string&quot;&#xd;
            },&#xd;
            &quot;duration&quot;: 30,&#xd;
            &quot;status&quot;: &quot;string&quot;,&#xd;
            &quot;isAvailable&quot;: true,&#xd;
            &quot;overBooked&quot;: true,&#xd;
            &quot;isDoubleBook&quot;: true&#xd;
        }&#xd;
    ],&#xd;
    &quot;comment&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;text&quot;: &quot;&quot;,&#xd;
        &quot;isHtml&quot;: false&#xd;
    },&#xd;
    &quot;basedOn&quot;: [&#xd;
        {&#xd;
            &quot;id&quot;: 0,&#xd;
            &quot;code&quot;: &quot;&quot;,&#xd;
            &quot;display&quot;: &quot;&quot;,&#xd;
            &quot;type&quot;: &quot;&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;requestedPeriod&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;startDate&quot;: null,&#xd;
        &quot;endDate&quot;: null&#xd;
    },&#xd;
    &quot;modifyBy&quot;: &quot;&quot;,&#xd;
    &quot;checkInStatus&quot;: false,&#xd;
    &quot;modifiedDate&quot;: &quot;&quot;,&#xd;
    &quot;isActive&quot;: false,&#xd;
    &quot;createdBy&quot;: &quot;&quot;,&#xd;
    &quot;createdDate&quot;: null,&#xd;
    &quot;isDeleted&quot;: false,&#xd;
    &quot;patientInstruction&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;text&quot;: &quot;&quot;,&#xd;
        &quot;isHtml&quot;: false&#xd;
    },&#xd;
    &quot;patientAge&quot;: null,&#xd;
    &quot;patientGender&quot;: &quot;Male&quot;,&#xd;
    &quot;appointmentSpecialty&quot;: &quot;Internal Med&quot;,&#xd;
    &quot;primaryProvider&quot;: &quot;&quot;,&#xd;
    &quot;patientStatus&quot;: null&#xd;
}</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </elementProp>
        <stringProp name="HTTPSampler.domain">172.18.0.76</stringProp>
        <stringProp name="HTTPSampler.port">8083</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.path">/v1/appointments</stringProp>
        <stringProp name="HTTPSampler.method">POST</stringProp>
        <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
        <boolProp name="HTTPSampler.auto_redirects">true</boolProp>
        <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
      </HTTPSamplerProxy>
      <hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">180000</stringProp>
        </ConstantTimer>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Simple Data Writer" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>